
## Plan Result

[CI link](https://github.com/NaokiYazawa/bined-infra/actions/runs/5707045675)


<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.alb.aws_lb.main
  * module.alb.aws_lb_listener.alb_listener
  * module.alb.aws_lb_target_group.main
  * module.alb.aws_s3_bucket.alb_log
  * module.alb.aws_s3_bucket_lifecycle_configuration.alb_log
  * module.alb.aws_s3_bucket_policy.alb_log


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.alb.data.aws_iam_policy_document.alb_log will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "alb_log" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::582318560864:root",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.alb.aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "bined-hasura"
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-0ecb9e4d622873720",
        ]
      + subnets                                     = [
          + "subnet-06e4b653ba82a0dbb",
          + "subnet-0824e210311fe3361",
        ]
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)

      + access_logs {
          + bucket  = (known after apply)
          + enabled = true
          + prefix  = "alb"
        }
    }

  # module.alb.aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # module.alb.aws_lb_target_group.main will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "bined-hasura-alb-target-group"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0a20ed93f94539036"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = "200"
          + path                = "/healthz"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # module.alb.aws_s3_bucket.alb_log will be created
  + resource "aws_s3_bucket" "alb_log" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "bined-hasura-alb-log-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.alb.aws_s3_bucket_lifecycle_configuration.alb_log will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "alb_log" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = (known after apply)
          + status = "Enabled"

          + expiration {
              + days                         = 365
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
              + prefix = "logs/"
            }
        }
    }

  # module.alb.aws_s3_bucket_policy.alb_log will be created
  + resource "aws_s3_bucket_policy" "alb_log" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":10,"Program":"tfcmt","SHA1":"e8c64cf0a6f83a7605eca22c80099530640c609e","Vars":{},"WorkflowName":"Terraform"} -->